<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [23]:
#!pip install sqlalchemy==2.0.23
#!pip install mysql-connector-python
#!pip install mysqlclient
#!pip install --upgrade pandas

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [1]:
%load_ext sql

In [72]:
import csv
import pymysql
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:izak3662@localhost:3306/my_data1")

In [2]:
#!pip install -q pandas

In [4]:
%sql mysql+pymysql://root:izak3662@localhost:3306/my_data1

In [16]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("spacextbl", con=engine, if_exists='replace', index=False, method="multi")

101

**Note:This below code is added to remove blank rows from table**

In [17]:
result = %sql select * from spacextbl where Date is not null
%sql drop table spacextbl
result = result.DataFrame()
result.to_sql("spacextbl", con=engine)

 * mysql+pymysql://root:***@localhost:3306/my_data1
101 rows affected.
 * mysql+pymysql://root:***@localhost:3306/my_data1
0 rows affected.

101

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [35]:
print(result)

           Date Time (UTC) Booster_Version   Launch_Site  \
0    2010-06-04   18:45:00  F9 v1.0  B0003   CCAFS LC-40
1    2010-12-08   15:43:00  F9 v1.0  B0004   CCAFS LC-40
2    2012-05-22    7:44:00  F9 v1.0  B0005   CCAFS LC-40
3    2012-10-08    0:35:00  F9 v1.0  B0006   CCAFS LC-40
4    2013-03-01   15:10:00  F9 v1.0  B0007   CCAFS LC-40
..          ...        ...             ...           ...
96   2020-11-05   23:24:23    F9 B5B1062.1  CCAFS SLC-40
97   2020-11-16    0:27:00   F9 B5B1061.1     KSC LC-39A
98   2020-11-21   17:17:08    F9 B5B1063.1   VAFB SLC-4E
99   2020-11-25    2:13:00  F9 B5 B1049.7   CCAFS SLC-40
100  2020-12-06   16:17:08  F9 B5 B1058.4     KSC LC-39A

                                               Payload  PAYLOAD_MASS__KG_  \
0                 Dragon Spacecraft Qualification Unit                  0
1    Dragon demo flight C1, two CubeSats, barrel of...                  0
2                                Dragon demo flight C2                525
3                                         SpaceX CRS-1                500
4                                         SpaceX CRS-2                677
..                                                 ...                ...
96                                 GPS III-04 , Crew-1               4311
97                Crew-1, Sentinel-6 Michael Freilich               12500
98      Sentinel-6 Michael Freilich, Starlink 15 v1.0                1192
99                     Starlink 15 v1.0, SpaceX CRS-21              15600
100                                      SpaceX CRS-21               2972

         Orbit                      Customer Mission_Outcome  \
0          LEO                        SpaceX         Success
1    LEO (ISS)               NASA (COTS) NRO         Success
2    LEO (ISS)                   NASA (COTS)         Success
3    LEO (ISS)                    NASA (CRS)         Success
4    LEO (ISS)                    NASA (CRS)         Success
..         ...                           ...             ...
96         MEO                          USSF         Success
97   LEO (ISS)                    NASA (CCP)         Success
98         LEO  NASA / NOAA / ESA / EUMETSAT         Success
99         LEO                        SpaceX         Success
100  LEO (ISS)                    NASA (CRS)         Success

         Landing_Outcome
0    Failure (parachute)
1    Failure (parachute)
2             No attempt
3             No attempt
4             No attempt
..                   ...
96               Success
97               Success
98               Success
99               Success
100              Success

[101 rows x 10 columns]

In [18]:
unique_launchsite = %sql select distinct Launch_Site from spacextbl
unique_launchsite

 * mysql+pymysql://root:***@localhost:3306/my_data1
4 rows affected.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [30]:
fivels = %sql select Launch_Site from spacextbl where Launch_Site like 'VA%' limit 5
fivels

 * mysql+pymysql://root:***@localhost:3306/my_data1
5 rows affected.

[('VAFB SLC-4E',),
 ('VAFB SLC-4E',),
 ('VAFB SLC-4E',),
 ('VAFB SLC-4E',),
 ('VAFB SLC-4E',)]

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [37]:
payloadbynasa = %sql select sum(PAYLOAD_MASS__KG_) from spacextbl where Customer='NASA (CRS)'
payloadbynasa

 * mysql+pymysql://root:***@localhost:3306/my_data1
1 rows affected.

[(Decimal('45596'),)]

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [40]:
avgpayload = %sql select avg(PAYLOAD_MASS__KG_) from spacextbl where Booster_Version='F9 V1.1'
avgpayload

 * mysql+pymysql://root:***@localhost:3306/my_data1
1 rows affected.

[(Decimal('2928.4000'),)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [41]:
firstsuccess = %sql select min(date) from spacextbl where Landing_Outcome='Success'
firstsuccess

 * mysql+pymysql://root:***@localhost:3306/my_data1
1 rows affected.

[('2018-07-22',)]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [47]:
boosters = %sql select Booster_Version, PAYLOAD_MASS__KG_, Mission_Outcome from spacextbl where Mission_Outcome='Success' and PAYLOAD_MASS__KG_<6000 and PAYLOAD_MASS__KG_>4000
boosters

 * mysql+pymysql://root:***@localhost:3306/my_data1
21 rows affected.

[('F9 v1.1', 4535, 'Success'),
 ('F9 v1.1 B1011', 4428, 'Success'),
 ('F9 v1.1 B1014', 4159, 'Success'),
 ('F9 v1.1 B1016', 4707, 'Success'),
 ('F9 FT B1020', 5271, 'Success'),
 ('F9 FT B1022', 4696, 'Success'),
 ('F9 FT B1026', 4600, 'Success'),
 ('F9 FT B1030', 5600, 'Success'),
 ('F9 FT  B1021.2', 5300, 'Success'),
 ('F9 FT B1032.1', 5300, 'Success'),
 ('F9 B4 B1040.1', 4990, 'Success'),
 ('F9 FT  B1031.2', 5200, 'Success'),
 ('F9 FT  B1032.2', 4230, 'Success'),
 ('F9 B4  B1040.2', 5384, 'Success'),
 ('F9 B5 B1046.2', 5800, 'Success'),
 ('F9 B5 B1047.2', 5300, 'Success'),
 ('F9 B5 B1048.3', 4850, 'Success'),
 ('F9 B5 B1051.2 ', 4200, 'Success'),
 ('F9 B5B1060.1', 4311, 'Success'),
 ('F9 B5 B1058.2 ', 5500, 'Success'),
 ('F9 B5B1062.1', 4311, 'Success')]

### Task 7




##### List the total number of successful and failure mission outcomes

In [65]:
count = %sql select count(*) as num, Mission_Outcome from spacextbl group by Mission_Outcome
count

 * mysql+pymysql://root:***@localhost:3306/my_data1
4 rows affected.

[(98, 'Success'),
 (1, 'Failure (in flight)'),
 (1, 'Success (payload status unclear)'),
 (1, 'Success ')]

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [71]:
maximumpayload = %sql select Booster_Version, PAYLOAD_MASS__KG_ from spacextbl where PAYLOAD_MASS__KG_ > (select avg(PAYLOAD_MASS__KG_) from spacextbl)
maximumpayload
#%sql select avg(PAYLOAD_MASS__KG_) from spacextbl

 * mysql+pymysql://root:***@localhost:3306/my_data1
33 rows affected.

[('F9 FT B1029.1', 9600),
 ('F9 FT B1036.1', 9600),
 ('F9 FT B1037', 6761),
 ('F9 B4 B1041.1', 9600),
 ('F9 FT  B1036.2', 9600),
 ('F9 B4  B1041.2', 9600),
 ('F9 B4  B1043.2', 6460),
 ('F9 B5B1047.1', 7075),
 ('F9 B5B1048.1', 9600),
 ('F9 B5B1049.1', 7060),
 ('F9 B5 B1049.2', 9600),
 ('F9 B5B1051.1', 12055),
 ('F9 B5 B1049.3', 13620),
 ('F9 B5 B1047.3 ', 6500),
 ('F9 B5 B1048.4', 15600),
 ('F9 B5 B1056.3 ', 6956),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1046.4', 12050),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5B1058.1 ', 12530),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1059.3', 15410),
 ('F9 B5 B1051.5', 14932),
 ('F9 B5 B1049.6', 15440),
 ('F9 B5 B1060.2 ', 15600),
 ('F9 B5 B1058.3 ', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1060.3', 15600),
 ('F9 B5B1061.1 ', 12500),
 ('F9 B5 B1049.7 ', 15600)]

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [77]:
ranking = %sql select count(*) as num, Landing_Outcome from spacextbl where Date>'2010-06-04' and '2017-03-20'>Date group by Landing_Outcome order by Date desc
ranking

 * mysql+pymysql://root:***@localhost:3306/my_data1
8 rows affected.

[(5, 'Success (drone ship)'),
 (3, 'Success (ground pad)'),
 (1, 'Precluded (drone ship)'),
 (5, 'Failure (drone ship)'),
 (3, 'Controlled (ocean)'),
 (2, 'Uncontrolled (ocean)'),
 (10, 'No attempt'),
 (1, 'Failure (parachute)')]

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> Â© IBM Corporation 2021. All rights reserved. <h3/>